package main

import "fmt"

var SettingsDisabledNotice = `

ከእዚህ ቀጥሎ ሳያረጋግጡ መላክ ከፈልጉ 
ይህን ይጫኑ 👉🏽 /disabled 
`
var SettingsEnabledNotice = `

እያረጋገጡ መላክ ከፈልጉ 
ይህን ይጫኑ 👉🏽 /enabled
`

var MainMessage string = `[ㅤ](https://hexaddis.com/tut.gif)◍◍◌◌◌◎◈  መግለጫ  ◈◎◌◌◌◍◍  

◈ ብዙም እርብሻ የሌለበት ቦታ ቢሆን ይመረጣል \!\
◈ ከሚሰጥዎት የድምፅ አብነት ጋር ለማመሳሰል ይሞክሩ \!\
◈ ከ 1 ሰኮንድ ያልብለጥ ቢሆን ተመራጭ ነው \!\

◦ ለመጀመር ከስር ያለውን አዝራር ይጫኑ ◦`

const (
	AlertMsg               = "ይህን እርሶ ማድረግ አይችሉም !"
	AlertMessage           = "የራስዎን ጓደኛ ማሳለፍ አይችሉም !"
	AlertMessages          = "በአንተ ስር የተጋበዙ ሰዎች !"
	AlertMessageWithManual = "[ㅤ](https://hexaddis.com/manual.jpg)እባክዎ ድምፅ ብቻ ይላኩልኝ"
	TooManyMessage         = "በጣም ብዙ ጥያቄዎችን አድርገዋል እባክዎ በእርጋታ ይጠቀሙ"
	MicNotice              = "ደምፅ ለመቅዳት የ ማይክራፎን መልክቱን ይጫኑ"

	BlockNotice = `ለግዜው ስለታገዱ የ ቦቱን አስተዳደር ያናግሩ \!\

➥ [[ዋና አስተዳደር]((tg://user?id=395490182)](https://t.me/Tom201513)
➥ [[ምክትል አስተዳደር](tg://user?id=5084305533)](https://t.me/LambaSupport)
	`

	ThanksMessage = `┌˚❀̥──◌─ ላምባ ──◌─❀̥˚┐
	ㅤㅤ	ለትብብሮዎ እናመሰግናለን 
	ㅤㅤㅤㅤ	ለመቀጠል ↴`

	VoiceRequestMessage = `[ㅤ](https://hexaddis.com/voice03/%d.ogg) ከታች ያለውን ቃል ደግመው ይላኩልኝ
	ㅤㅤㅤ◌◎◍ \#%s\ ◍◎◌
	
	ㅤ%s
	ㅤ`

	profile = `❁✼✼✭✤✥✤✬❉❈❋✷❊✵❉
	❋
	✼     ጠቅላላ የድምፅ ቅጂ 
	✾ㅤㅤㅤㅤㅤ↳%d
	✥  ቀሪ  ያልተቀዳ ድምፅ ብዛት 
	❊ㅤㅤㅤㅤㅤ↳%d
	❈ㅤㅤየተጣራ የድምፅ ብዛት
	❋ㅤㅤㅤㅤㅤ↳%d
	✼ㅤㅤᴥ የተጋባዥ ብዛት ᴥ 
	❉ㅤㅤㅤㅤㅤ↳%d
	❉ በአንተ ስር የተጋበዙ ሰዎች
	❉ㅤㅤㅤㅤㅤ↳%.0f
	❉ በእርሶ ስር የተቀዱ ቃላቶች
	❉ㅤㅤㅤㅤㅤ↳%.0f
	❉በእርሶ ስር ማረጋገጫ ያገኙ ቃላቶች 
	❉ㅤㅤㅤㅤㅤ↳%.0f
	----------------------------------
	❊ㅤㅤㅤㅤአማካይ ውጤት
	❊ㅤㅤㅤㅤㅤ↳%.2f
	❊ㅤㅤㅤㅤ𐃫 ደረጃ 𐃫
	✵ㅤㅤㅤㅤㅤ↳%d
	----------------------------------
	`
)

var BlockedNotice string = `User %s Blocked By`

var WordList = []string{
	"ሰላም", "ላምባ", "ከ", "የ", "በ", "ለ", "ኛ", "ደህና", "አደርሽ", "ዋልሽ", "አመሸሽ", "ነሽ",
	"አይ", "ተዪው", "ይቅር", "አልፈልግም", "በቃኝ", "ይበቃኛል", "ቻው", "እሺ", "አዎ", "እፈልጋለሁ",
	"ቀጥይ", "ይደገም", "ድገሚ", "ድገሚልኝ", "ድገሚው", "ነው", "ላኪልኝ", "ላኪ", "ላኪው", "አንብቢልኝ",
	"አዲስ", "ያዢልኝ", "አለ", "አለኝ", "ንገሪኝ", "ሆነ", "ቀኑ", "ላይ", "ተልኮልኛል", "ነበረኝ", "ዘርዝሪሊኝ", "ዘርዝሪ",
	"አንብቢ", "ስንት", "መልዕክት", "ያዢ", "አስቀምጪ", "የዛሬው", "የዛሬ", "ሲደመር", "ሲቀነስ", "ሲካፈል", "ሲባዛ", "ደምሪ",
	"ቀንሺ", "አካፍይ", "አባዢ", "ሰኞ", "ማክሰኞ", "ዕሮብ", "ሀሙስ", "አርብ", "ቅዳሜ", "እሁድ", "ነገ", "ትናት", "ዛሬ", "ድምጽ", "ቀንሺ",
	"አጥፊ", "ዝቅ", "አርጊ", "ጨምሪልኝ", "ስልክ", "ቁጥሩ", "ቁጥር", "ማንቂያ", "ደውል", "ሙይልኝ", "ሙይ", "ሰአት", "ንገሪኝ", "ቀን", "ቀኑን",
	"ዜሮ", "አንድ", "ሁለት", "ሶስት", "አራት", "አምስት", "ስድስት", "ሰባት", "ስምንት", "ዘጠኝ", "አስር", "አስራ", "ሃያ", "ሰላሳ", "አርባ",
	"ሃምሳ", "ስልሳ", "ሰባ", "ሰማንያ", "ዘጠና", "መቶ", "ሺ", "ሚሊየን", "የት", "ምን", "ማን", "እንዴት", "ለምን", "አይነቶች",
	"ክፍሎች", "ዝርዝሮች", "ዋጋ", "ያህል", "መች", "ትርጉም", "ትርጉሙ", "መቼ", "ማለት", "ምንድን", "ነኝ", "ያለሁበት",
	"ቦታ", "ያለሁት", "ያህል", "ይርቃል", "እዚህ", "ምን", "አዲስ", "ነገር", "ውሎ", "ዜና", "ነበር", "አየሩ", "ጃኬት",
	"ዣንጥላ", "መያዝ", "አለብኝ", "የአየር", "ሁኔታ", "መልበስ", "ደውይ", "ደውይልኝ", "ደውይለት",
	"ደውይላት", "ማስታወሻ", "ቴሌግራም", "ኢሜል", "መጽሐፍ", "ክፍል", "ታሪክ", "ምዕራፍ", "ሚስኮል", "ትዕዛዝ"}

func (s *Service) ProfileMsgBuilder(userID int64, msgID int) string {
	var user *User
	var found bool

	if user, found = s.Users[userID]; !found {
		s.CreateUser(userID, 0, msgID)
		return fmt.Sprintf(profile, 0, 0, 0, 0, 0.0, 0.0, 0.0, 0.0, 0)
	}

	totalVoice := len(user.Datasets)
	remainVoice := len(s.WordList) - totalVoice
	userInvited := len(user.Invited)

	return fmt.Sprintf(profile, totalVoice, remainVoice, user.Confirmed, userInvited, user.TreeInvitation, user.TreeRecord, user.TreeConfirmed, user.Avarage, user.Rank)
}
